In [9]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import sqlalchemy as db
import sqlalchemy
from sqlalchemy import create_engine, inspect, func
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker, Session
from sqlalchemy.ext.automap import automap_base
from config import user
from config import password

In [10]:
# params = {
#     "user": user,
#     "password": password
# }

# You will need to input your own Postgres username and password below
connection_uri = f"postgresql://{user}:{password}@localhost:5432/employees_db"
engine = create_engine(connection_uri) 
engine = db.create_engine(connection_uri)

connection = engine.connect()
metadata = db.MetaData()
employees = db.Table('employees', metadata, autoload=True, autoload_with=engine)

In [11]:
# Import the employees table
employees = pd.read_sql('select * from employees', connection, parse_dates=['birth_date', 'hire_date'])
employees.head()

  emp_no birth_date first_name last_name gender  hire_date
0  10001 1953-09-02     Georgi   Facello      M 1986-06-26
1  10002 1964-06-02    Bezalel    Simmel      F 1985-11-21
2  10003 1959-12-03      Parto   Bamford      M 1986-08-28
3  10004 1954-05-01  Chirstian   Koblick      M 1986-12-01
4  10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12

In [ ]:
# Import the departments table
departments = pd.read_sql('select * from departments', connection)
departments.head()

In [ ]:
# Import the Salaries table
salaries = pd.read_sql('select * from salaries', connection, parse_dates=['from_date', 'to_date'])
salaries.head()

In [ ]:
# Import the dept_manager table
dept_manager = pd.read_sql('select * from dept_manager', connection, parse_dates=['from_date', 'to_date'])
dept_manager.head()

In [ ]:
# replace the 'NaT dates'
dept_manager.to_date = dept_manager['to_date'].fillna(pd.to_datetime('2050-12-31'))
dept_manager.head()

In [ ]:
# Import the titles table
titles = pd.read_sql('select * from titles', connection, parse_dates=['from_date', 'to_date'])
titles.head()

In [ ]:
# replace the 'NaT dates'
titles.to_date = titles['to_date'].fillna(pd.to_datetime('2050-12-31'))
titles.head()

In [ ]:
# Count by title
titles.title.value_counts()

In [ ]:
# Average salary by title
# Merge titles and salaries

employee_salaries = titles.merge(salaries, on='emp_no')
employee_salaries.head()

In [ ]:
employee_salaries_df = employee_salaries[['emp_no', 'title', 'salary']]
employee_salaries_df.head()

In [ ]:
employee_salaries_df.groupby('title')['salary'].mean().round(2)

# The pay for each title are very similar and low in the range of 48,000 to 59,000 dollars only.

In [ ]:
employee_salaries_df.hist(column='salary')

In [ ]:
employees_grouped_by_title = employee_salaries_df.groupby(['title'])['salary'].mean()

employees_grouped_by_title.plot.bar()

In [ ]:
employees.keys()

In [ ]:
numbers = employees['emp_no'] 
badge = str(499942)
x = 0          
for number in numbers:
    if (number == badge):
        print(employees['emp_no'][x],employees['first_name'][x],employees['last_name'][x])
    else:
        x += 1

# The badge numbered 499942 is assigned to a user named "April Foolsday"